lkolbly/cmsis-svd/data/Atmel/ATSAMD10D13A.svd
        <register>
          <name>INTENCLR</name>
          <description>MODE1 Interrupt Enable Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CMP0</name>
              <description>Compare 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1</name>
              <description>Compare 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>MODE1 Interrupt Enable Set</description>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CMP0</name>
              <description>Compare 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1</name>
              <description>Compare 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>MODE1 Interrupt Flag Status and Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CMP0</name>
              <description>Compare 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1</name>
              <description>Compare 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER</name>
          <description>MODE1 Counter Period</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PER</name>
              <description>Counter Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READREQ</name>
          <description>Read Request</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <resetValue>0x0010</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCONT</name>
              <description>Read Continuously</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RREQ</name>
              <description>Read Request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
       </cluster> <!-- RtcMode1 -->
       <cluster>
        <name>MODE2</name>
        <description>Clock/Calendar with Alarm</description>
        <alternateCluster>MODE0</alternateCluster>
        <headerStructName>RtcMode2</headerStructName>
        <addressOffset>0x0</addressOffset>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run During Debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQCORR</name>
          <description>Frequency Correction</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SIGN</name>
              <description>Correction Sign</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK</name>
          <description>MODE2 Clock Value</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SECOND</name>
              <description>Second</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MINUTE</name>
              <description>Minute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hour</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>HOURSelect</name>
                <enumeratedValue>
                  <name>PM</name>
                  <description>Afternoon Hour</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAY</name>
              <description>Day</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MONTH</name>
              <description>Month</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>MODE2 Control</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>COUNT32</name>
                  <description>Mode 0: 32-bit Counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT16</name>
                  <description>Mode 1: 16-bit Counter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Mode 2: Clock/Calendar</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKREP</name>
              <description>Clock Representation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MATCHCLR</name>
              <description>Clear on Match</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PRESCALERSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/1024</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>MODE2 Event Control</description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PEREO0</name>
              <description>Periodic Interval 0 Event Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO1</name>
              <description>Periodic Interval 1 Event Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO2</name>
              <description>Periodic Interval 2 Event Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO3</name>
              <description>Periodic Interval 3 Event Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO4</name>
              <description>Periodic Interval 4 Event Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO5</name>
              <description>Periodic Interval 5 Event Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO6</name>
              <description>Periodic Interval 6 Event Output Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO7</name>
              <description>Periodic Interval 7 Event Output Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALARMEO0</name>
              <description>Alarm 0 Event Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFEO</name>
              <description>Overflow Event Output Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>MODE2 Interrupt Enable Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ALARM0</name>
              <description>Alarm 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>MODE2 Interrupt Enable Set</description>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ALARM0</name>
              <description>Alarm 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>MODE2 Interrupt Flag Status and Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ALARM0</name>
              <description>Alarm 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>1</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>ALARM%s</name>
          <description>MODE2 Alarm n Value</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SECOND</name>
              <description>Second</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MINUTE</name>
              <description>Minute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hour</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DAY</name>
              <description>Day</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MONTH</name>
              <description>Month</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>1</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>MASK%s</name>
          <description>MODE2 Alarm n Mask</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Alarm Mask Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SELSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Alarm Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS</name>
                  <description>Match seconds only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMSS</name>
                  <description>Match seconds and minutes only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HHMMSS</name>
                  <description>Match seconds, minutes, and hours only</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDHHMMSS</name>
                  <description>Match seconds, minutes, hours, and days only</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMDDHHMMSS</name>
                  <description>Match seconds, minutes, hours, days, and months only</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YYMMDDHHMMSS</name>
                  <description>Match seconds, minutes, hours, days, months, and years</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>READREQ</name>
          <description>Read Request</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <resetValue>0x0010</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCONT</name>
              <description>Read Continuously</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RREQ</name>
              <description>Read Request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
       </cluster> <!-- RtcMode2 -->
      </registers>
    </peripheral>
